JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/inc/cw32l012_atim.h
/*******************************************************************************
*
* 代码许可和免责信息
* 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
* 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
* 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
* 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
* 或条件。
* 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
* 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
* 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
* 损失。
* 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
* 全部上述排除或限制可能并不适用于您。
*
*******************************************************************************/
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CW32L012_ATIM_H
#define __CW32L012_ATIM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "system_cw32l012.h"

/******************************************************************************
 * type definitions ('typedef')
 ******************************************************************************/
typedef struct
{
    FunctionalState BufferState;      /*!<  ARR缓存使能 */

    uint32_t CounterAlignedMode;      /*!< 计数对齐模式: 边沿或中央 */

    uint32_t CounterDirection;        /*!< 计数方向 */

    uint32_t CounterOPMode;           /*!< 运行模式：单次或重复 */

    uint32_t Prescaler;               /*!< 预分频系数 */

    uint32_t ReloadValue;           /*!< ARR赋值，取值范围0x0000~0xFFFF */

    uint32_t RepetitionCounter;     /*!< 重复周期计数值，RCR寄存器 */

} ATIM_InitTypeDef;

typedef struct
{
    uint32_t OCPolarity;  /*!< 端口极性选择：正向、反向 */

    uint32_t OCMode;     /*!< 比较模式配置 */

    uint32_t OCFastMode;            /*!< 快速比较模式 */

    FunctionalState OCInterruptState; /*!< 比较匹配触发中断使能状态 */

    FunctionalState BufferState;    /*!< 比较缓存使能状态 */

    FunctionalState OCComplement;   /*!< 比较互补输出 */
} ATIM_OCInitTypeDef;

typedef struct
{
    uint32_t ICMap;                /* IC映射 */

    uint32_t ICPrescaler;          /* 输入捕获预分配 */

    uint32_t ICFilter;             /*!< 输入滤波配置 */

    uint32_t ICPolarity;  /*!< 输入捕获极性：上升、下降、双沿 */


} ATIM_ICInitTypeDef;


typedef enum ATIM_ETR_SOURCE
{
    ATIM_ETRSOURCE_ETR_PIN = 0,
    ATIM_ETRSOURCE_VC1_OUT,
    ATIM_ETRSOURCE_VC2_OUT,
    ATIM_ETRSOURCE_VC3_OUT,
    ATIM_ETRSOURCE_VC4_OUT,
    ATIM_ETRSOURCE_ADC1_AWD,
    ATIM_ETRSOURCE_ADC2_AWD,
    ATIM_ETRSOURCE_LVD_OUT,
    ATIM_ETRSOURCE_BTIM1ETR,
    ATIM_ETRSOURCE_BTIM2ETR,
    ATIM_ETRSOURCE_BTIM3ETR,
    ATIM_ETRSOURCE_GTIM1ETR,
    ATIM_ETRSOURCE_GTIM2ETR,
    ATIM_ETRSOURCE_GTIM3ETR,
    ATIM_ETRSOURCE_GTIM4ETR
} ATIM_ETRSourceTypeDef;

typedef struct
{
    ATIM_ETRSourceTypeDef Source;
    uint32_t Polarity;
    uint32_t Prescaler;
    uint32_t Filter;
} ATIM_ETRInitTypeDef;

typedef enum
{
    FILTER_CLOCK_DIV1 = 0x00,  // 滤波时钟不分频，fDTS = fPCLK/1
    FILTER_CLOCK_DIV2 = 0x01,  // 滤波时钟2分频，fDTS = fPCLK/2
    FILTER_CLOCK_DIV4 = 0x02   // 滤波时钟4分频，fDTS = fPCLK/4
} ATIM_FilterClockDivTypeDef;

/******************************************************************************
 * pre-processor symbols/macros ('#define')
 ******************************************************************************/
/********************************** CR1 ***************************************/
#define ATIM_UIF_REMAP_ENABLE                  (1UL << ATIM_CR1_UIFREMAP_Pos)
#define ATIM_UIF_REMAP_DISABLE                 0UL

#define ATIM_FILTER_CLOCK_PCLK_DIV1            (0UL)
#define ATIM_FILTER_CLOCK_PCLK_DIV2            (1UL << ATIM_CR1_CKD_Pos)
#define ATIM_FILTER_CLOCK_PCLK_DIV4            (2UL << ATIM_CR1_CKD_Pos)

#define ATIM_BUFFER_ENABLE                     (1UL << ATIM_CR1_ARPE_Pos)
#define ATIM_BUFFER_DISABLE                    (0UL)


#define ATIM_COUNT_ALIGN_MODE_EDGE             (0UL << ATIM_CR1_CMS_Pos)
#define ATIM_COUNT_ALIGN_MODE_CENTER_DOWN      (1UL << ATIM_CR1_CMS_Pos)
#define ATIM_COUNT_ALIGN_MODE_CENTER_UP        (2UL << ATIM_CR1_CMS_Pos)
#define ATIM_COUNT_ALIGN_MODE_CENTER_BOTH      (3UL << ATIM_CR1_CMS_Pos)
#define IS_ATIM_COUNT_MODE(MODE)               (((MODE) == ATIM_COUNT_ALIGN_MODE_EDGE) || \
                                                ((MODE) == ATIM_COUNT_ALIGN_MODE_CENTER_DOWN) || \
                                                ((MODE) == ATIM_COUNT_ALIGN_MODE_CENTER_UP) || \
                                                ((MODE) == ATIM_COUNT_ALIGN_MODE_CENTER_BOTH))

#define ATIM_COUNTING_UP                       (0UL)
#define ATIM_COUNTING_DOWN                     (1UL << ATIM_CR1_DIR_Pos)
#define IS_ATIM_COUNTING_DIRECTION(DIR)        (((DIR) == ATIM_COUNTING_UP) || \
                                               ((DIR) == ATIM_COUNTING_DOWN))

#define ATIM_OP_MODE_SINGLE                    (1UL << ATIM_CR1_OPM_Pos)
#define ATIM_OP_MODE_REPETITIVE                (0UL)
#define IS_ATIM_OP_MODE(MODE)                  (((MODE) == ATIM_OP_MODE_SINGLE) || \
                                               ((MODE) == ATIM_OP_MODE_REPETITIVE))

#define ATIM_UPDATE_EVENT_NORMAL               (1UL << ATIM_CR1_URS_Pos)  // 上溢出/下溢出
#define ATIM_UPDATE_EVENT_EXTENSION            (0UL) // 上溢出/下溢出/软件更新/从模式复位
#define IS_ATIM_UPDATE_EVENT(EVENT)            ((EVENT) == ATIM_UPDATE_EVENT_NORMAL || \
                                               (EVENT) == ATIM_UPDATE_EVENT_EXTENSION)

#define ATIM_UPDATE_EVENT_DISABLE              (1UL << ATIM_CR1_UDIS_Pos)
#define ATIM_UPDATE_EVENT_ENABLE               (0UL)

/********************************** CR2 ***************************************/

/********************************** SMCR **************************************/
#define ATIM_ETR_POLARITY_POSITIVE             (0UL)
#define ATIM_ETR_POLARITY_NEGATIVE             (1UL << ATIM_SMCR_ETP_Pos)
#define IS_ATIM_ETR_POLARITY(POLARITY)         (((POLARITY) == ATIM_ETR_POLARITY_INVERT) || \
                                               ((POLARITY) == ATIM_ETR_POLARITY_NONINVERT))

#define ATIM_ETR_PRESCALE_NONE                 (0UL)
#define ATIM_ETR_PRESCALE_DIV2                 (1UL << ATIM_SMCR_ETPS_Pos)
#define ATIM_ETR_PRESCALE_DIV4                 (2UL << ATIM_SMCR_ETPS_Pos)
#define ATIM_ETR_PRESCALE_DIV8                 (3UL << ATIM_SMCR_ETPS_Pos)

#define ATIM_ETR_FILTER_NONE                   (0UL)
#define ATIM_ETR_FILTER_DIV1_N2                (1UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV1_N4                (2UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV1_N8                (3UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV2_N6                (4UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV2_N8                (5UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV4_N6                (6UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV4_N8                (7UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV8_N6                (8UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV8_N8                (9UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV16_N5               (10UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV16_N6               (11UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV16_N8               (12UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV32_N5               (13UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV32_N6               (14UL << ATIM_SMCR_ETF_Pos)
#define ATIM_ETR_FILTER_DIV32_N8               (15UL << ATIM_SMCR_ETF_Pos)

/** @defgroup ATIM_TS Trigger Selection
  * @{
  */
#define ATIM_TS_ITR0                         0x00000000U                                                     /*!< Internal Trigger 0 (ITR0) is used as trigger input */
#define ATIM_TS_ITR1                         (0x00000001UL << ATIM_SMCR_TS_Pos)                              /*!< Internal Trigger 1 (ITR1) is used as trigger input */
#define ATIM_TS_ITR2                         (0x00000002UL << ATIM_SMCR_TS_Pos)                              /*!< Internal Trigger 2 (ITR2) is used as trigger input */
#define ATIM_TS_ITR3                         (0x00000003UL << ATIM_SMCR_TS_Pos)                              /*!< Internal Trigger 3 (ITR3) is used as trigger input */
#define ATIM_TS_TI1F_ED                      (0x00000004UL << ATIM_SMCR_TS_Pos)                              /*!< TI1 Edge Detector (TI1F_ED) is used as trigger input */
#define ATIM_TS_TI1FP1                       (0x00000005UL << ATIM_SMCR_TS_Pos)                              /*!< Filtered Timer Input 1 (TI1FP1) is used as trigger input */
#define ATIM_TS_TI2FP2                       (0x00000006UL << ATIM_SMCR_TS_Pos)                              /*!< Filtered Timer Input 2 (TI12P2) is used as trigger input */
#define ATIM_TS_ETRF                         (0x00000007UL << ATIM_SMCR_TS_Pos)                              /*!< Filtered external Trigger (ETRF) is used as trigger input */
#define ATIM_TS_ITR4                         (0x00000001UL << ATIM_SMCR_TSH_Pos)                             /*!< Internal Trigger 4 (ITR4) is used as trigger input */
#define ATIM_TS_ITR5                         (ATIM_TS_ITR4 | ATIM_TS_ITR1)                                   /*!< Internal Trigger 5 (ITR5) is used as trigger input */
#define ATIM_TS_ITR6                         (ATIM_TS_ITR4 | ATIM_TS_ITR2)                                   /*!< Internal Trigger 6 (ITR6) is used as trigger input */
#define ATIM_TS_ITR7                         (ATIM_TS_ITR4 | ATIM_TS_ITR3)                                   /*!< Internal Trigger 7 (ITR7) is used as trigger input */
#define ATIM_TS_ITR8                         (ATIM_TS_ITR4 | ATIM_TS_TI1F_ED)                                /*!< Internal Trigger 8 (ITR8) is used as trigger input */
#define ATIM_TS_ITR9                         (ATIM_TS_ITR4 | ATIM_TS_TI1FP1)                                 /*!< Internal Trigger 9 (ITR9) is used as trigger input */
#define ATIM_TS_ITR10                        (ATIM_TS_ITR4 | ATIM_TS_TI2FP2)                                 /*!< Internal Trigger 10 (ITR10) is used as trigger input */
#define ATIM_TS_ITR11                        (ATIM_TS_ITR4 | ATIM_TS_ETRF)                                   /*!< Internal Trigger 11 (ITR11) is used as trigger input */
#define ATIM_TS_ITR12                        (ATIM_TS_ITR4 << 1)                                             /*!< Internal Trigger 12 (ITR12) is used as trigger input */
#define IS_ATIM_TRIGGER_INPUT(TS)            ((TS == ATIM_TS_ITR0) ||\
                                              (TS == ATIM_TS_ITR1) ||\
                                              (TS == ATIM_TS_ITR2) ||\
                                              (TS == ATIM_TS_ITR3) ||\
                                              (TS == ATIM_TS_ITR4) ||\
                                              (TS == ATIM_TS_ITR5) ||\
                                              (TS == ATIM_TS_ITR6) ||\
                                              (TS == ATIM_TS_ITR7) ||\
                                              (TS == ATIM_TS_ITR8) ||\
                                              (TS == ATIM_TS_ITR9) ||\
                                              (TS == ATIM_TS_ITR10) ||\
                                              (TS == ATIM_TS_ITR11) ||\
                                              (TS == ATIM_TS_ITR12) ||\
                                              (TS == ATIM_TS_TI1F_ED) ||\
                                              (TS == ATIM_TS_TI1FP1) ||\
                                              (TS == ATIM_TS_TI2FP2) ||\
                                              (TS == ATIM_TS_ETRF))


#define ATIM_SLAVER_TYPE_PCLK                  0x00    // 内部时钟
#define ATIM_SLAVER_TYPE_ENCODE1               0x01    // 正交编码计数模式1
#define ATIM_SLAVER_TYPE_ENCODE2               0x02    // 正交编码计数模式2
#define ATIM_SLAVER_TYPE_ENCODE3               0x03    // 正交编码计数模式3
#define ATIM_SLAVER_TYPE_RESET                 0x04    // 复位功能
#define ATIM_SLAVER_TYPE_GATE                  0x05    // 门控功能
#define ATIM_SLAVER_TYPE_TRIGGER               0x06    // 触发模式
#define ATIM_SLAVER_TYPE_EXT                   0x07    // 外部时钟
#define ATIM_SLAVER_TYPE_RESET_TRIGGER         0x08    // RESET+TRGI
#define ATIM_SLAVER_TYPE_RESET_GATE            0x09    // RESET+GATE
#define ATIM_SLAVER_TYPE_ENCODE2_CLOCK_DIR     0x0A    // 编码模式——时钟+方向，×2模式
#define ATIM_SLAVER_TYPE_ENCODE1_CLOCK_DIR     0x0B    // 编码模式——时钟+方向，×1模式
#define ATIM_SLAVER_TYPE_ENCODE2_FIX_DIR       0x0C    // 编码模式 定向时钟，×2模式
#define ATIM_SLAVER_TYPE_ENCODE1_FIX_DIR       0x0D    // 编码模式 定向时钟，×2模式
#define ATIM_SLAVER_TYPE_QUAD_ENCODE1          0x0E    // 正交编码模式——×1模式
#define ATIM_SLAVER_TYPE_QUAD_ENCODE2          0x0F    // 正交编码模式——×1模式

#define IS_ATIM_SLAVER_TYPE(TYPE)              ((TYPE) <= 0x07)

